app/controllers/tokimons_controller.rb

SELECT "tokimons".* FROM "tokimons"
---
  def index
    @tokimons = Tokimon.all

SELECT "tokimons".* FROM "tokimons"
---
  def display
    @tokimons = Tokimon.all

INSERT INTO "tokimons" ("created_at", "electric", "fight", "fire", "fly", "frozen_or_ice", "height", "name", "total", "trainer_id", "updated_at", "water", "weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tokimon = Tokimon.new(params[:tokimon])
    @tokimon.save

SELECT "tokimons".* FROM "tokimons" WHERE "tokimons"."id" = ? LIMIT 1  [["id", "26"]]
---
    def set_tokimon
      @tokimon = Tokimon.find(params[:id])