app/views/tokimons/_form.html.erb

      <%= f.label :trainer_id , class: "control-label" %><br />
      <%= f.select :trainer_id, Trainer.all.map{|t| [t.name,t.id] }, {}, {class: 'form-control', style: "color:red;"} %>
---
SELECT "trainers".* FROM "trainers"