app/views/trainers/index.html.erb

SELECT COUNT(*) FROM "tokimons" WHERE "tokimons"."trainer_id" = 4
---
        <td><%= trainer.level rescue ""%></td>
        <td><%= trainer.tokimons.size rescue ""%></td>